/*=====================================
  ■■■ 연산자(Operator) ■■■
  - 비트 단위 연산자 
=====================================*/

public class Test022
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;

		System.out.printf("~a : %d\n", ~a);   // ~ 비트열 반전
		System.out.printf("~b : %d\n", ~b);
	}
}
/*
a=10      --> 00001010 →→→ 11110101 (결과) ==> -11
                     //(검산)    ↓    2의 보수 = (1의 보수) + (+1)
                              00001011 --> 11 맞음
							 

b=-10     -->  00001010 →→→ 11110101 --> 11110110(= -10) 얘를 비트열 반전 해야겠지?
          -->  00001001 = 9 맞음
*/ 
 
/* 
~a : -11
~b : 9
계속하려면 아무 키나 누르십시오 . . .
*/