/*====================================
  ■■■ 자바의 개요 및 특징 ■■■
  Test001.java
  - 기본 실습
====================================*/

// 단일행 주석문 처리(한 줄 주석 처리) → 라인 단위 주석 처리

/*
여러줄
(다중행)
주석문
처리								  → 블럭 단위 주석 처리	
*/

// ·클래스 이름은 『Test001』
// ·자바 프로그램에서 클래스의 이름은 대문자로 시작
// ·자바 프로그램 시작할 때 클래스(class)와 main() 을 기본적으로 입력
// ·소스 코드 저장 시 클래스 이름과 동일한 파일 이름으로 저장
//   단, 이 때 확장자는 『*.java』
public class Test001
{
	// main() 메소드
	//-- 자바 인터프리터가 처음 찾는 메소드(함수)
	public static void main(String[] args)
	{
		//
		// 당분간 우리의 코딩 영역
		//

		System.out.println("프로그램 실행 테스트");
	}
}

/*
[실행 결과]
프로그램 실행 테스트
계속하려면 아무 키나 누르십시오 . . .
*/